//============================================================
//
//	通常敵処理 [enemyNormal.cpp]
//	Author：藤田勇一
//
//============================================================
#if 1
//************************************************************
//	インクルードファイル
//************************************************************
#include "EnemyBullet.h"
#include "manager.h"
#include "renderer.h"
#include "bullet.h"

//************************************************************
//	定数宣言
//************************************************************
namespace
{

}

//************************************************************
//	静的メンバ変数宣言
//************************************************************
const char* CEnemyBullet::mc_apModelFile[] =	// モデル定数
{
	"data\\MODEL\\ENEMY\\1225_tama_003.x",	// 通常敵
};

//************************************************************
//	子クラス [CEnemyBullet] のメンバ関数
//************************************************************
//============================================================
//	コンストラクタ
//============================================================
CEnemyBullet::CEnemyBullet(const EType type) : CEnemy(type)
{
	// メンバ変数をクリア
	m_nCntBullet = 0;

}

//============================================================
//	デストラクタ
//============================================================
CEnemyBullet::~CEnemyBullet()
{

}

//============================================================
//	初期化処理
//============================================================
HRESULT CEnemyBullet::Init(void)
{
	// メンバ変数を初期化


	// 敵の初期化
	if (FAILED(CEnemy::Init()))
	{ // 初期化に失敗した場合

		// 失敗を返す
		return E_FAIL;
	}

	// モデルを読込・割当
	BindModel("data\\MODEL\\ENEMY\\1225_tama_003.x");

	SetAlpha(0.0f);

	// 成功を返す
	return S_OK;
}

//============================================================
//	終了処理
//============================================================
void CEnemyBullet::Uninit(void)
{
	// 敵の終了
	CEnemy::Uninit();
}

//============================================================
//	更新処理
//============================================================
void CEnemyBullet::Update(void)
{
	switch (GetState())
	{ // 状態ごとの処理
	case STATE_SPAWN:

		// スポーン動作の更新
		UpdateSpawn();

		break;

	case STATE_NORMAL:

		// 敵動作の更新
		UpdateAction();

		m_nCntBullet++;

		if (m_nCntBullet % 180 == 0)
		{
			CBullet* pBullet = CBullet::Create(false);
			pBullet->SetVec3Position(GetVec3Position());
			pBullet->SetMove(D3DXVECTOR3(
				-cosf(GetVec3Rotation().y + D3DX_PI * -0.5f) * 25.0f,
				0.0f,
				sinf(GetVec3Rotation().y + D3DX_PI * -0.5f) * 25.0f
			));
		}

		break;

	case STATE_KNOCK:

		// 吹っ飛び時の更新
		UpdateKnock();

		break;

	case STATE_DEATH:

		// 死亡動作の更新
		if (UpdateDeath())
		{ // 死亡した場合

			// 処理を抜ける
			return;
		}

		break;

	default:	// 例外処理
		assert(false);
		break;
	}

	// 敵の更新
	CEnemy::Update();
}

//============================================================
//	描画処理
//============================================================
void CEnemyBullet::Draw(void)
{
	// 敵の描画
	CEnemy::Draw();
}
#endif
